<script setup>
import BasicLayout from '@/Layouts/BasicLayout.vue';
import { Head, Link } from '@inertiajs/vue3';
</script>

<template>
<BasicLayout>
  <Head :title="'利用規約'" />

  <div class="min-h-screen w-screen max-w-[1320px] bg-gray-100 py-10">
    <div class="w-11/12 md:w-9/12 max-w-3xl mx-auto p-2 bg-white text-gray-700">
      <div class="mx-auto">
        <div class="w-full px-2 space-y-3">
          <h1 class="pb-1 font-bold md:text-xl leading-tight border-b-4 border-gray-400">利用規約</h1>
          <h2 class="font-bold">第1条 総則</h2>
          <p>(1) この利用規約（以下、「本規約」といいます。）は、ウェブサイト「FANGA」（以下、「当サイト」といいます。）がこのウェブサイト上で提供するサービス（以下、「本サービス」といいます。）の利用条件を定めるものです。当サイトをご利用される皆さまには、本規約に従って、本サービスをご利用いただきます。</p>
          <p>(2) 当サイトは本サービスに関し、本規約のほか、ご利用にあたってのルール等、各種の定め（以下、「個別規定」といいます。）をすることがあります。これら個別規定はその名称のいかんに関わらず、本規約の一部を構成するものとします。</p>
          <p>(3) 本規約の規定が前条の個別規定の規定と矛盾する場合には、個別規定において特段の定めなき限り、個別規定の規定が優先されるものとします。</p>
          <p>(4) 利用者とは当サイトを閲覧、メモ(文章)の投稿、会員登録等を行なった方のことです。</p>
          <p>(5)本サービスの利用者は、本規約、その他の当サイトが定める規約、ルール、ガイドライン等に従って本サービスを利用するものとします。</p>
          <h2 class="font-bold">第2条 本規約等の発効</h2>
          <p>利用者が当サイトの会員登録を行った時点、または本サービスを利用した時点で、利用者は本規約等を承諾したものと看做し、効力を生じます。</p>
          <h2 class="font-bold">第3条 利用資格</h2>
          <p>本サービスには成人向けの内容を含んでいる為、18歳未満もしくは居住地域の法律で閲覧を認められていない方の利用を禁止します。年齢を偽ってアクセスした場合には、利用者自身が所属する国や地域の法令により処罰される可能性があります。</p>
          <h2 class="font-bold">第4条 会員登録</h2>
          <p>(1) 本サービスの会員登録においては、登録希望者が本規約に同意の上、当サイトの定める方法によって会員登録を申請し、会員登録が完了（以下、「ユーザー」といいます。）するものとします。</p>
          <p>(2) 当サイトは、会員登録の申請者に以下の事由があると判断した場合、会員登録の申請を承認しないことがあり、その理由については一切の開示義務を負わないものとします。</p>
          <ul class="pl-5 space-y-2 list-inside list-decimal">
            <li>本規約に違反したことがある者からの申請である場合</li>
            <li>その他、当サイトが利用登録を相当でないと判断した場合</li>
          </ul>
          <p>(3) ユーザーは、自己の責任において、本サービスに登録したメールアドレスおよびパスワードを適切に管理するものとします。</p>
          <p>(4) ユーザーは、いかなる場合にも、メールアドレスおよびパスワードを第三者に譲渡または貸与し、もしくは第三者と共用することはできません。当サイトは、メールアドレスとパスワードの組み合わせが登録情報と一致してログインされた場合には、そのメールアドレスを登録しているユーザー自身による利用とみなします。</p>
          <p>(5) メールアドレス及びパスワードが第三者によって使用されたことによって生じた損害は、当サイトに故意又は重大な過失がある場合を除き、当サイトは一切の責任を負わないものとします。</p>
          <h2 class="font-bold">第5条 ユーザーの個人情報</h2>
          <p>当サイトが本サービスを通じて入手したユーザーに関する一切の個人情報については、<Link :href="route('privacy')" class="text-blue-500">プライバシーポリシー</Link>に従い、これを取り扱うものとし、ユーザーはこれに同意するものとします。</p>
          <h2 class="font-bold">第6条 利用料等</h2>
          <p>本サービスの利用料は無料です。</p>
          <h2 class="font-bold">第7条 広告について</h2>
          <p>当サイトは、デジタルコンテンツ配信サービスの「FANZA」及び「DUGA」のアフィリエイト広告を掲載しています。</p>
          <h2 class="font-bold">第8条 禁止事項</h2>
          <p>ユーザーまたは利用者は、本サービスの利用にあたり、以下の行為をしてはなりません。</p>
          <ul class="pl-3 space-y-2 list-inside list-decimal">
          <li>法令、公序良俗または本規約等に違反する行為</li>
          <li>犯罪行為に関連する行為</li>
          <li>当サイト、本サービスの他のユーザー、または第三者のサーバーまたはネットワークの機能を破壊したり、妨害したりする行為</li>
          <li>当サイトのサービスの運営を妨害するおそれのある行為</li>
          <li>他のユーザーに関する個人情報等を収集または蓄積する行為</li>
          <li>不正アクセスをし、またはこれを試みる行為</li>
          <li>他のユーザーに成りすます行為</li>
          <li>当サイトのサービスに関連して、反社会的勢力に対して直接または間接に利益を供与する行為</li>
          <li>当サイト、本サービスの他のユーザーまたは第三者の知的財産権、肖像権、プライバシー、名誉その他の権利または利益を侵害する行為</li>
          <li>以下の表現を含み、または含むと当サイトが判断する内容を本サービス上に投稿し、または送信する行為</li>
          <ul class="pl-5 py-1 space-y-2 list-inside list-decimal">
            <li>過度に暴力的な表現</li>
            <li>露骨な性的表現</li>
            <li>人種、国籍、信条、性別、社会的身分、門地等による差別につながる表現</li>
            <li>自殺、自傷行為、薬物乱用を誘引または助長する表現</li>
            <li>その他反社会的な内容を含み他人に不快感を与える表現</li>
          </ul>
          <li>以下を目的とし、または目的とすると当サイトが判断する行為</li>
          <ul class="pl-5 py-1 space-y-2 list-inside list-decimal">
            <li>営業、宣伝、広告、勧誘、その他営利を目的とする行為（当サイトの認めたものを除きます。）</li>
            <li>面識のない異性との出会いや交際を目的とする行為</li>
            <li>他のユーザーに対する嫌がらせや誹謗中傷を目的とする行為</li>
            <li>当サイト、コンテンツ提供者、著作者、その他の第三者の著作権、商標権等の知的財産権を侵害する行為、または侵害する恐れのある行為。</li>
            <li>当サイト、本サービスの他のユーザー、または第三者に不利益、損害または不快感を与えることを目的とする行為</li>
            <li>その他本サービスが予定している利用目的と異なる目的で本サービスを利用する行為</li>
          </ul>
          <li>宗教活動または宗教団体への勧誘行為</li>
          <li>その他、当サイトが不適切と判断する行為</li>
          </ul>
          <h2 class="font-bold">第9条 設備等</h2>
          <p>(1) 利用者は、本サービスを利用する為に必要なコンピュータ、デバイス、通信機器、メディア、その他これらに付随して必要となる全ての機器を、自己の費用と責任において準備し、本サービスが利用可能な状態に置くものとします。また、自己の費用と責任で、いずれかの電気通信事業者のインターネット接続サービスを経由して当サイトにアクセスするものとします。</p>
          <p>(2) 利用者の通信環境、回線状態、コンピュータ等の問題により、本サービスを利用できない状態が生じても当サイトは一切の責任を負いません。</p>
          <h2 class="font-bold">第10条 利用者の責任</h2>
          <p>(1) 利用者は、自ら本サービスを利用してなした一切の行為およびその結果について、全ての責任を負います。</p>
          <p>(2) 利用者が本規約等に違反し、もしくは本サービスの利用に伴う故意または過失により、当サイト、コンテンツ提供者、著作者、その他の第三者に対して損害を与えた場合、自己の責任と費用をもって損害を賠償するものとします。</p>
          <h2 class="font-bold">第11条 本サービスの提供の停止等</h2>
          <p>(1) 当サイトは、以下のいずれかの事由があると判断した場合、ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。</p>
          <ul class="pl-5 py-1 space-y-2 list-inside list-decimal">
            <li>本サービスにかかるコンピュータシステムの保守点検または更新を行う場合</li>
            <li>地震、落雷、火災、停電または天災などの不可抗力により、本サービスの提供が困難となった場合</li>
            <li>コンピュータまたは通信回線等が事故により停止した場合</li>
            <li>その他、当サイトが本サービスの提供が困難と判断した場合</li>
          </ul>
          <p>(2) 当サイトは、本サービスの提供の停止または中断により、ユーザーまたは第三者が被ったいかなる不利益または損害についても、一切の責任を負わないものとします。</p>
          <h2 class="font-bold">第10条 著作権</h2>
          <p>(1) ユーザーは、自ら著作権等の必要な知的財産権を有するか、または必要な権利者の許諾を得た文章の情報に関してのみ、本サービスを利用し、投稿することができるものとします。</p>
          <p>(2) 当サイトは、本サービスを利用して投稿した文章について、本サービスの改良、品質の向上、または不備の是正等ならびに本サービスの周知宣伝等に利用できるものとし、ユーザーは、この利用に関して、著作者人格権を行使しないものとします。</p>
          <p>(3) 前項本文の定めるものを除き、本サービスおよび本サービスに関連する一切の情報についての著作権およびその他の知的財産権はすべて当サイトまたは当サイトにその利用を許諾した権利者に帰属し、ユーザーは無断で複製、譲渡、貸与、翻訳、改変、転載、公衆送信（送信可能化を含みます。）、伝送、配布、出版、営業使用等をしてはならないものとします。</p>
          <h2 class="font-bold">第11条 利用制限および登録抹消</h2>
          <p>(1) 当サイトは、ユーザーが以下のいずれかに該当する場合には、事前の通知なく、投稿データの修正又は削除を行い、ユーザーに対して本サービスの全部もしくは一部の利用を制限しまたはユーザーとしての登録を抹消することができるものとします。</p>
          <ul class="pl-5 py-1 space-y-2 list-inside list-decimal">
            <li>本規約のいずれかの条項に違反した場合</li>
            <li>登録事項に虚偽の事実があることが判明した場合</li>
            <li>当サイトからの連絡に対し、一定期間返答がない場</li>
            <li>本サービスについて、最終の利用から一定期間利用がない場合</li>
            <li>その他、当サイトが本サービスの利用を適当でないと判断した場合</li>
          </ul>
          <p>(2) 前項各号のいずれかに該当した場合、ユーザーは、当然に当サイトに対する一切の債務について期限の利益を失い、その時点において負担する一切の債務を直ちに一括して弁済しなければなりません。</p>
          <p>(3) 当サイトは、本条に基づき当サイトが行った行為によりユーザーに生じた損害について、一切の責任を負いません。</p>
          <h2 class="font-bold">第13条 退会</h2>
          <p>ユーザーは、当サイトの定める退会手続により、本サービスから退会できるものとします。</p>
          <h2 class="font-bold">第14条 免責事項</h2>
          <p>(1) 当サイトは、ユーザーへ事前に通知することなく、本サービスの全部もしくは一部の変更、追加、停止または終了すること、ならびにコンテンツを変更、削除することがあります。これによって、ユーザーに何らかの損害、不利益が生じても当サイトは理由の如何を問わず一切責任を負いません。</p>
          <p>(2) 当サイトは、本サービスに事実上または法律上の瑕疵（安全性、信頼性、正確性、完全性、有効性、特定の目的への適合性、セキュリティなどに関する欠陥、エラーやバグ、権利侵害、ウィルス等の有害プログラムなどを含みます。）がないことを明示的にも黙示的にも一切保証しておりません。</p>
          <p>(3) 当サイトは、ユーザーに対し、適宜情報提供やアドバイスを行うことがありますが、それにより責任を負うものではありません。</p>
          <p>(4) 当サイトは、本サービスに関して、ユーザーと他のユーザーまたは第三者との間において生じた取引、連絡または紛争等について一切責任を負いません。</p>
          <p>(5) 当サイトからリンクやバナーなどによって他のサイトに移動された場合、移動先サイトで提供される情報、サービス等について一切の責任を負いません。</p>
          <p>(6) 当サイトに掲載された内容によって生じた損害等の一切の責任を負いかねますのでご了承ください。</p>
          <h2 class="font-bold">第15条 本規約の改定等</h2>
          <p>(1) 当サイトは、ユーザーへ事前に通知することなく、本規約の内容を適宜改定できるものとします。</p>
          <p>(2) 本規約が改定された場合、本サービス内の所定のウェブページへ改定後の本規約が掲載された時点、またはその他の方法により改定後の本規約が閲覧可能となった時点で有効になります。</p>
          <h2 class="font-bold">第16条 準拠法・裁判管轄</h2>
          <p>(1) 本規約の解釈にあたっては、日本法を準拠法とします。</p>
          <p>(2) 本サービスに関して紛争が生じた場合には、当サイトの運営者所在地を管轄する裁判所を専属的合意管轄とします。</p>
          <p class="font-bold">附則</p>
          <p>本規約は2023年2月26日から適用されます。</p>
          <p>[発効日:2023年2月26日]</p>
          <!-- <p>[最終改定日:2023年3月1日]</p> -->
        </div>
      </div>
    </div>
  </div>
</BasicLayout>
</template>